const { EmbedBuilder } = require("discord.js");

module.exports.run = async (client, message, args) => {

      let responses = [
        "Пам'ятайте, павуки бояться вас більше, ніж ви їх",
        "Українська мова друга по мелодійності, поступаючись лише італійській",
        "В Україні найглибша в світі станція метро, глибиною 105.5м",
        "За підрахунками, українська мова містить приблизно 256 тисяч слів",
        "Гугл має дуже багато таємниць, спробуй їх розгадати...",
        "Юпітер може вмістити в себе понад тисяч планет розміром як Земля",
        "Сліди астронавтів з корабля Аполон можуть залишитися там понад 100 млн років",
        "Енергія від сонця, яка потрапляє на Землю більша, ніж вся планета споживає за рік",
        "Кожні три секунди народжується одна людина",
        "Багато котів здатні знайти шлях додому, навіть якщо це величезні відстані",
        "Котів можна розрізнити, як людей за відбитками пальців, тільки у котячих це відбиток носа",
        "За статистикою, 80% людей мають домашніх тварин",
          "Зір собак не є чорно-білим, хоч звісно в них й не така широка гамма кольорів",
        "Рівень інтелекту собаки такий ж самий, як у дворічної дитини",
          "Тарас Шевченко був невисокого зросту – трішки більше 164 см",
          "Один з кратерів на Меркурії був названий **Шевченко**, на честь українського поета Тараса Григоровича Шевченка",
          "У бідних кварталах Китаю звичне явище, що квартира є розміром 4,5 квадратних метрів",
       "Найбільшим словом української мови є: **рентгеноелектрокардіографічного**, в якому 31 буква",
          "**Заповіт** - вірш Тараса Шевченка, який було перекладено 147 мовами світу",
          "Найчастіше козаки їли рибу, бо саме її ловили у водоймах",
          "Найбільш відвідуваною країною Європи є Франція, а найбільш відвідуваним містом — Париж",
          "Географічний центр Європи знаходиться в Україні, село Ділове"
              ];
      let response =
        responses[Math.floor(Math.random() * responses.length - 1)];
        if (response === undefined) response = responses[Math.floor(Math.random() * responses.length - 1)];
      let Embed = new EmbedBuilder()
        .setTitle("Факт")
        .setDescription(response)
        .setColor("Random")
        .setThumbnail(client.user.displayAvatarURL())
        await message.reply({
            embeds:[Embed]
        })
    
}
module.exports.desc = ""